# Cable Size Neutral Conductor Size Property

Source: https://www.revitapidocs.com/2026/d1f8cdc5-fedf-a3d8-f529-c01a870b8160.htm

---

| Cable Size Neutral Conductor Size Property |
| --- |

The size of a Neutral Conductor.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId NeutralConductorSize { get; set; }
```

```
Public Property NeutralConductorSize As ElementId
	Get
	Set
```

```
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member NeutralConductorSize : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks Each Neutral Conductor has the same size. See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace